src/main/resources/wsdl/Accounts.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/"
				  xmlns:tns="http://www.briansdevblog.com/Accounts/" 
				  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
				  xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="Accounts"
			      targetNamespace="http://www.briansdevblog.com/Accounts/"
				  xmlns:accounts="http://com/blog/demo/webservices/accountservice">
	<wsdl:types>
		<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import namespace="http://com/blog/demo/webservices/accountservice"
				schemaLocation="../schema/AccountService.xsd">
			</xsd:import>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="AccountDetailsRequest">
		<wsdl:part element="accounts:AccountDetailsRequest" name="parameters" />
	</wsdl:message>
	<wsdl:message name="AccountDetailsResponse">
		<wsdl:part element="accounts:AccountDetailsResponse" name="parameters" />
	</wsdl:message>
	<wsdl:portType name="AccountService">
		<wsdl:operation name="GetAccountDetails">
			<wsdl:input message="tns:AccountDetailsRequest" />
			<wsdl:output message="tns:AccountDetailsResponse" />
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="AccountServiceSoapBinding" type="tns:AccountService">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="GetAccountDetails">
			<soap:operation
				soapAction="http://www.briansjavablog.com/Accounts/GetAccountDetails" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="AccountService">
		<wsdl:port binding="tns:AccountServiceSoapBinding" name="AccountsPort">
			<soap:address
				location="http://localhost:8080/apache-cfx-demo/services/accounts" />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>